---
kind: other
id: Methods.T:Autodesk.Revit.DB.ElementType
source: html/515d49cb-efec-9c5c-b8fb-44746e3e083a.htm
---
# ElementType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.